app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "status without a name!"], ["created_at", Fri, 04 Oct 2013 17:37:35 UTC +00:00], ["updated_at", Fri, 04 Oct 2013 17:37:35 UTC +00:00], ["user_id", nil]]
---
  def create
    @status = Status.new(params[:status])

    respond_to do |format|
      if @status.save

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "statuses" SET "content" = 'I''m still on Treebook', "updated_at" = '2013-09-28 20:49:57.224733' WHERE "statuses"."id" = 1
---
  def update
    @status = Status.find(params[:id])

    respond_to do |format|
      if @status.update_attributes(params[:status])